# DATA JOINING
---

The table below contains a list of products ordered in the online store.

OrderNo | Date | Product | Quantity
--------|------|---------|:-------:
295 | 2024-02-09 | chair | 6
295 | 2024-02-12 | lamp  | 6
312 | 2024-02-17 | desk | 2
312 | 2024-02-17 | lamp | 1
314 | 2024-02-18 | desk | 4

The table below contains the price list of products in this store. As you can see, both tables contain product names. You can therefore combine them into one common data collection.

Product | Price
--------|------:
desk | 450.00
chair | 275.00
lamp | 79.00

First, you need to create data collections corresponding to the contents of the tables.

In [28]:
orders_data = {
    'OrderNo':['295','295','312','312','314'],
    'Date':['2024-02-09','2024-02-09','2024-02-17','2024-02-17','2024-02-18'],
    'Product':['chair','lamp','desk','lamp','desk'],
    'Quantity':[6,6,2,1,4]}
price_list = {'Product':['desk','chair','lamp'], 'Price':[450.00, 275.00, 79.00]}

Now, based on the data collections, you create DataFrames.

In [31]:
import pandas as pd
orders = pd.DataFrame(orders_data)
prices = pd.DataFrame(price_list)

Finally, you join both DataFrames and display their common content. Note the use of the 'merge' function. You must provide the names of both DataFrames and the name of the column that contains the common data.

In [32]:
orders_with_prices = pd.merge(orders,prices,on='Product')
orders_with_prices

  OrderNo        Date Product  Quantity  Price
0     295  2024-02-09   chair         6  275.0
1     295  2024-02-09    lamp         6   79.0
2     312  2024-02-17    lamp         1   79.0
3     312  2024-02-17    desk         2  450.0
4     314  2024-02-18    desk         4  450.0

You can also complete the final DataFrame by adding a new column containing the amount to be paid for the ordered products.

In [33]:
orders_with_prices['Total'] = orders_with_prices['Quantity'] * orders_with_prices['Price']
orders_with_prices

  OrderNo        Date Product  Quantity  Price   Total
0     295  2024-02-09   chair         6  275.0  1650.0
1     295  2024-02-09    lamp         6   79.0   474.0
2     312  2024-02-17    lamp         1   79.0    79.0
3     312  2024-02-17    desk         2  450.0   900.0
4     314  2024-02-18    desk         4  450.0  1800.0

### Tasks

It turns out that the store offers a discount on selected products. Currently, the discount on desks is 20%, while the discount on lamps is 30%. Create another DataFrame containing a list of discounted products. Then, join the discounted data with the previous data collections. Calculate and display the amounts to pay, after taking into account the discount.